reports/textSummary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/scenarios/load-login.js
        output: -

     scenarios: (100.00%) 3 scenarios, 70 max VUs, 3m30s max duration (incl. graceful stop):
              * warm_up: 5.00 iterations/s for 30s (maxVUs: 5-20, gracefulStop: 30s)
              * main_load: 20.00 iterations/s for 2m0s (maxVUs: 10-50, startTime: 30s, gracefulStop: 30s)
              * cool_down: 5.00 iterations/s for 30s (maxVUs: 5-20, startTime: 2m30s, gracefulStop: 30s)

time="2026-03-30T11:45:15-05:00" level=info msg="\n=== FakeStore Login Load Test ===" source=console
time="2026-03-30T11:45:15-05:00" level=info msg="✓ Credentials: 5 entries loaded from CSV" source=console
time="2026-03-30T11:45:15-05:00" level=info msg="✓ Base URL   : https://fakestoreapi.com" source=console
time="2026-03-30T11:45:15-05:00" level=info msg="✓ Endpoint   : /auth/login" source=console
time="2026-03-30T11:45:15-05:00" level=info msg="Starting scenarios...\n" source=console

running (0m01.0s), 03/15 VUs, 2 complete and 0 interrupted iterations
warm_up     [   3% ] 03/05 VUs  01.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    29.0s     
cool_down • [   0% ] waiting    2m29.0s   

running (0m02.0s), 01/15 VUs, 9 complete and 0 interrupted iterations
warm_up     [   7% ] 01/05 VUs  02.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    28.0s     
cool_down • [   0% ] waiting    2m28.0s   

running (0m03.0s), 02/15 VUs, 13 complete and 0 interrupted iterations
warm_up     [  10% ] 02/05 VUs  03.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    27.0s     
cool_down • [   0% ] waiting    2m27.0s   

running (0m04.0s), 01/15 VUs, 19 complete and 0 interrupted iterations
warm_up     [  13% ] 01/05 VUs  04.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    26.0s     
cool_down • [   0% ] waiting    2m26.0s   

running (0m05.0s), 01/15 VUs, 24 complete and 0 interrupted iterations
warm_up     [  17% ] 01/05 VUs  05.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    25.0s     
cool_down • [   0% ] waiting    2m25.0s   

running (0m06.0s), 01/15 VUs, 29 complete and 0 interrupted iterations
warm_up     [  20% ] 01/05 VUs  06.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    24.0s     
cool_down • [   0% ] waiting    2m24.0s   

running (0m07.0s), 01/15 VUs, 34 complete and 0 interrupted iterations
warm_up     [  23% ] 01/05 VUs  07.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    23.0s     
cool_down • [   0% ] waiting    2m23.0s   

running (0m08.0s), 01/15 VUs, 39 complete and 0 interrupted iterations
warm_up     [  27% ] 01/05 VUs  08.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    22.0s     
cool_down • [   0% ] waiting    2m22.0s   

running (0m09.0s), 01/15 VUs, 44 complete and 0 interrupted iterations
warm_up     [  30% ] 01/05 VUs  09.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    21.0s     
cool_down • [   0% ] waiting    2m21.0s   

running (0m10.0s), 01/15 VUs, 49 complete and 0 interrupted iterations
warm_up     [  33% ] 01/05 VUs  10.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    20.0s     
cool_down • [   0% ] waiting    2m20.0s   

running (0m11.0s), 01/15 VUs, 54 complete and 0 interrupted iterations
warm_up     [  37% ] 01/05 VUs  11.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    19.0s     
cool_down • [   0% ] waiting    2m19.0s   

running (0m12.0s), 01/15 VUs, 59 complete and 0 interrupted iterations
warm_up     [  40% ] 01/05 VUs  12.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    18.0s     
cool_down • [   0% ] waiting    2m18.0s   

running (0m13.0s), 02/15 VUs, 63 complete and 0 interrupted iterations
warm_up     [  43% ] 02/05 VUs  13.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    17.0s     
cool_down • [   0% ] waiting    2m17.0s   

running (0m14.0s), 01/15 VUs, 69 complete and 0 interrupted iterations
warm_up     [  47% ] 01/05 VUs  14.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    16.0s     
cool_down • [   0% ] waiting    2m16.0s   

running (0m15.0s), 01/15 VUs, 74 complete and 0 interrupted iterations
warm_up     [  50% ] 01/05 VUs  15.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    15.0s     
cool_down • [   0% ] waiting    2m15.0s   

running (0m16.0s), 01/15 VUs, 79 complete and 0 interrupted iterations
warm_up     [  53% ] 01/05 VUs  16.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    14.0s     
cool_down • [   0% ] waiting    2m14.0s   

running (0m17.0s), 01/15 VUs, 84 complete and 0 interrupted iterations
warm_up     [  57% ] 01/05 VUs  17.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    13.0s     
cool_down • [   0% ] waiting    2m13.0s   

running (0m18.0s), 01/15 VUs, 89 complete and 0 interrupted iterations
warm_up     [  60% ] 01/05 VUs  18.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    12.0s     
cool_down • [   0% ] waiting    2m12.0s   

running (0m19.0s), 01/15 VUs, 94 complete and 0 interrupted iterations
warm_up     [  63% ] 01/05 VUs  19.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    11.0s     
cool_down • [   0% ] waiting    2m11.0s   

running (0m20.0s), 01/15 VUs, 99 complete and 0 interrupted iterations
warm_up     [  67% ] 01/05 VUs  20.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    10.0s     
cool_down • [   0% ] waiting    2m10.0s   

running (0m21.0s), 01/15 VUs, 104 complete and 0 interrupted iterations
warm_up     [  70% ] 01/05 VUs  21.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    09.0s     
cool_down • [   0% ] waiting    2m09.0s   

running (0m22.0s), 01/15 VUs, 109 complete and 0 interrupted iterations
warm_up     [  73% ] 01/05 VUs  22.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    08.0s     
cool_down • [   0% ] waiting    2m08.0s   

running (0m23.0s), 02/15 VUs, 113 complete and 0 interrupted iterations
warm_up     [  77% ] 02/05 VUs  23.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    07.0s     
cool_down • [   0% ] waiting    2m07.0s   

running (0m24.0s), 02/15 VUs, 118 complete and 0 interrupted iterations
warm_up     [  80% ] 02/05 VUs  24.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    06.0s     
cool_down • [   0% ] waiting    2m06.0s   

running (0m25.0s), 02/15 VUs, 123 complete and 0 interrupted iterations
warm_up     [  83% ] 02/05 VUs  25.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    05.0s     
cool_down • [   0% ] waiting    2m05.0s   

running (0m26.0s), 01/15 VUs, 129 complete and 0 interrupted iterations
warm_up     [  87% ] 01/05 VUs  26.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    04.0s     
cool_down • [   0% ] waiting    2m04.0s   

running (0m27.0s), 02/15 VUs, 133 complete and 0 interrupted iterations
warm_up     [  90% ] 02/05 VUs  27.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    03.0s     
cool_down • [   0% ] waiting    2m03.0s   

running (0m28.0s), 02/15 VUs, 138 complete and 0 interrupted iterations
warm_up     [  93% ] 02/05 VUs  28.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    02.0s     
cool_down • [   0% ] waiting    2m02.0s   

running (0m29.0s), 02/15 VUs, 143 complete and 0 interrupted iterations
warm_up     [  97% ] 02/05 VUs  29.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    01.0s     
cool_down • [   0% ] waiting    2m01.0s   

running (0m30.0s), 02/15 VUs, 148 complete and 0 interrupted iterations
warm_up     [ 100% ] 02/05 VUs  30.0s/30s  5.00 iters/s
main_load • [   0% ] waiting    00.0s     
cool_down • [   0% ] waiting    2m00.0s   

running (0m31.0s), 08/16 VUs, 162 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   1% ] 08/11 VUs  0m01.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m59.0s      

running (0m32.0s), 09/20 VUs, 177 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   2% ] 09/15 VUs  0m02.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m58.0s      

running (0m33.0s), 09/22 VUs, 195 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   2% ] 09/17 VUs  0m03.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m57.0s      

running (0m34.0s), 08/24 VUs, 214 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   3% ] 08/19 VUs  0m04.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m56.0s      

running (0m35.0s), 09/24 VUs, 233 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   4% ] 09/19 VUs  0m05.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m55.0s      

running (0m36.0s), 09/24 VUs, 253 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   5% ] 09/19 VUs  0m06.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m54.0s      

running (0m37.0s), 09/24 VUs, 273 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   6% ] 09/19 VUs  0m07.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m53.0s      

running (0m38.0s), 09/24 VUs, 293 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   7% ] 09/19 VUs  0m08.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m52.0s      

running (0m39.0s), 09/24 VUs, 313 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   7% ] 09/19 VUs  0m09.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m51.0s      

running (0m40.0s), 09/24 VUs, 333 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   8% ] 09/19 VUs  0m10.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m50.0s      

running (0m41.0s), 09/24 VUs, 353 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [   9% ] 09/19 VUs  0m11.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m49.0s      

running (0m42.0s), 09/24 VUs, 373 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  10% ] 09/19 VUs  0m12.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m48.0s      

running (0m43.0s), 14/24 VUs, 388 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  11% ] 14/19 VUs  0m13.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m47.0s      

running (0m44.0s), 12/27 VUs, 407 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  12% ] 12/22 VUs  0m14.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m46.0s      

running (0m44.8s), 10/27 VUs, 425 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  12% ] 10/22 VUs  0m14.8s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m45.2s      

running (0m44.8s), 10/27 VUs, 425 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  12% ] 10/22 VUs  0m14.8s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m45.2s      

running (0m45.0s), 14/27 VUs, 425 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  12% ] 14/22 VUs  0m15.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m45.0s      

running (0m46.0s), 16/28 VUs, 442 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  13% ] 16/23 VUs  0m16.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m44.0s      

running (0m47.0s), 16/31 VUs, 459 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  14% ] 16/26 VUs  0m17.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m43.0s      

running (0m48.0s), 19/32 VUs, 475 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  15% ] 19/27 VUs  0m18.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m42.0s      

running (0m49.0s), 18/33 VUs, 495 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  16% ] 18/28 VUs  0m19.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m41.0s      

running (0m50.0s), 19/33 VUs, 514 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  17% ] 19/28 VUs  0m20.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m40.0s      

running (0m51.0s), 22/34 VUs, 530 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  17% ] 22/29 VUs  0m21.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m39.0s      

running (0m52.0s), 19/36 VUs, 551 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  18% ] 19/31 VUs  0m22.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m38.0s      

running (0m53.0s), 24/36 VUs, 566 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  19% ] 24/31 VUs  0m23.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m37.0s      

running (0m54.0s), 19/38 VUs, 589 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  20% ] 19/33 VUs  0m24.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m36.0s      

running (0m55.0s), 22/38 VUs, 606 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  21% ] 22/33 VUs  0m25.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m35.0s      

running (0m56.0s), 28/38 VUs, 620 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  22% ] 28/33 VUs  0m26.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m34.0s      

running (0m57.0s), 20/42 VUs, 644 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  22% ] 20/37 VUs  0m27.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m33.0s      

running (0m58.0s), 23/42 VUs, 661 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  23% ] 23/37 VUs  0m28.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m32.0s      

running (0m59.0s), 22/42 VUs, 682 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  24% ] 22/37 VUs  0m29.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m31.0s      

running (1m00.0s), 24/42 VUs, 700 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  25% ] 24/37 VUs  0m30.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m30.0s      

running (1m01.0s), 25/43 VUs, 718 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  26% ] 25/38 VUs  0m31.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m29.0s      

running (1m02.0s), 23/43 VUs, 740 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  27% ] 23/38 VUs  0m32.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m28.0s      

running (1m03.0s), 23/43 VUs, 760 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  27% ] 23/38 VUs  0m33.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m27.0s      

running (1m04.0s), 27/43 VUs, 776 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  28% ] 27/38 VUs  0m34.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m26.0s      

running (1m05.0s), 25/43 VUs, 798 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  29% ] 25/38 VUs  0m35.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m25.0s      

running (1m06.0s), 23/43 VUs, 820 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  30% ] 23/38 VUs  0m36.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m24.0s      

running (1m07.0s), 26/43 VUs, 837 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  31% ] 26/38 VUs  0m37.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m23.0s      

running (1m08.0s), 28/43 VUs, 855 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  32% ] 28/38 VUs  0m38.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m22.0s      

running (1m09.0s), 23/44 VUs, 879 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  32% ] 23/39 VUs  0m39.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m21.0s      

running (1m10.0s), 25/44 VUs, 897 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  33% ] 25/39 VUs  0m40.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m20.0s      

running (1m11.0s), 25/44 VUs, 917 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  34% ] 25/39 VUs  0m41.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m19.0s      

running (1m12.0s), 25/44 VUs, 937 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  35% ] 25/39 VUs  0m42.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m18.0s      

running (1m13.0s), 25/44 VUs, 957 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  36% ] 25/39 VUs  0m43.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m17.0s      

running (1m14.0s), 23/44 VUs, 979 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  37% ] 23/39 VUs  0m44.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m16.0s      

running (1m15.0s), 22/44 VUs, 1000 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  37% ] 22/39 VUs  0m45.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m15.0s      

running (1m16.0s), 26/44 VUs, 1016 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  38% ] 26/39 VUs  0m46.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m14.0s      

running (1m17.0s), 24/44 VUs, 1038 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  39% ] 24/39 VUs  0m47.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m13.0s      

running (1m18.0s), 21/44 VUs, 1061 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  40% ] 21/39 VUs  0m48.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m12.0s      

running (1m19.0s), 24/44 VUs, 1078 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  41% ] 24/39 VUs  0m49.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m11.0s      

running (1m20.0s), 27/44 VUs, 1095 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  42% ] 27/39 VUs  0m50.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m10.0s      

running (1m21.0s), 25/44 VUs, 1117 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  42% ] 25/39 VUs  0m51.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m09.0s      

running (1m22.0s), 26/44 VUs, 1136 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  43% ] 26/39 VUs  0m52.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m08.0s      

running (1m23.0s), 24/44 VUs, 1158 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  44% ] 24/39 VUs  0m53.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m07.0s      

running (1m24.0s), 25/44 VUs, 1177 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  45% ] 25/39 VUs  0m54.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m06.0s      

running (1m25.0s), 21/45 VUs, 1200 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  46% ] 21/40 VUs  0m55.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m05.0s      

running (1m26.0s), 24/45 VUs, 1217 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  47% ] 24/40 VUs  0m56.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m04.0s      

running (1m27.0s), 21/45 VUs, 1240 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  47% ] 21/40 VUs  0m57.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m03.0s      

running (1m28.0s), 24/45 VUs, 1257 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  48% ] 24/40 VUs  0m58.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m02.0s      

running (1m29.0s), 23/45 VUs, 1278 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  49% ] 23/40 VUs  0m59.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m01.0s      

running (1m30.0s), 26/45 VUs, 1295 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  50% ] 26/40 VUs  1m00.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    1m00.0s      

running (1m31.0s), 21/45 VUs, 1320 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  51% ] 21/40 VUs  1m01.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m59.0s      

running (1m32.0s), 24/45 VUs, 1337 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  52% ] 24/40 VUs  1m02.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m58.0s      

running (1m33.0s), 24/45 VUs, 1357 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  52% ] 24/40 VUs  1m03.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m57.0s      

running (1m34.0s), 21/45 VUs, 1380 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  53% ] 21/40 VUs  1m04.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m56.0s      

running (1m35.0s), 24/45 VUs, 1397 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  54% ] 24/40 VUs  1m05.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m55.0s      

running (1m36.0s), 24/45 VUs, 1417 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  55% ] 24/40 VUs  1m06.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m54.0s      

running (1m37.0s), 25/45 VUs, 1436 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  56% ] 25/40 VUs  1m07.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m53.0s      

running (1m38.0s), 24/45 VUs, 1457 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  57% ] 24/40 VUs  1m08.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m52.0s      

running (1m39.0s), 23/45 VUs, 1478 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  57% ] 23/40 VUs  1m09.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m51.0s      

running (1m40.0s), 22/45 VUs, 1499 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  58% ] 22/40 VUs  1m10.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m50.0s      

running (1m41.0s), 25/45 VUs, 1516 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  59% ] 25/40 VUs  1m11.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m49.0s      

running (1m42.0s), 26/45 VUs, 1535 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  60% ] 26/40 VUs  1m12.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m48.0s      

running (1m43.0s), 23/45 VUs, 1558 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  61% ] 23/40 VUs  1m13.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m47.0s      

running (1m44.0s), 24/45 VUs, 1577 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  62% ] 24/40 VUs  1m14.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m46.0s      

running (1m45.0s), 23/45 VUs, 1598 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  62% ] 23/40 VUs  1m15.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m45.0s      

running (1m46.0s), 27/45 VUs, 1614 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  63% ] 27/40 VUs  1m16.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m44.0s      

running (1m47.0s), 28/45 VUs, 1633 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  64% ] 28/40 VUs  1m17.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m43.0s      

running (1m48.0s), 24/45 VUs, 1657 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  65% ] 24/40 VUs  1m18.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m42.0s      

running (1m49.0s), 25/45 VUs, 1676 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  66% ] 25/40 VUs  1m19.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m41.0s      

running (1m50.0s), 27/45 VUs, 1694 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  67% ] 27/40 VUs  1m20.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m40.0s      

running (1m51.0s), 24/45 VUs, 1717 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  67% ] 24/40 VUs  1m21.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m39.0s      

running (1m52.0s), 23/45 VUs, 1738 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  68% ] 23/40 VUs  1m22.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m38.0s      

running (1m53.0s), 25/45 VUs, 1756 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  69% ] 25/40 VUs  1m23.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m37.0s      

running (1m54.0s), 21/45 VUs, 1780 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  70% ] 21/40 VUs  1m24.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m36.0s      

running (1m55.0s), 22/45 VUs, 1799 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  71% ] 22/40 VUs  1m25.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m35.0s      

running (1m56.0s), 19/45 VUs, 1822 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  72% ] 19/40 VUs  1m26.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m34.0s      

running (1m57.0s), 22/45 VUs, 1839 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  72% ] 22/40 VUs  1m27.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m33.0s      

running (1m58.0s), 28/45 VUs, 1853 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  73% ] 28/40 VUs  1m28.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m32.0s      

running (1m59.0s), 26/45 VUs, 1875 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  74% ] 26/40 VUs  1m29.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m31.0s      

running (2m00.0s), 27/45 VUs, 1894 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  75% ] 27/40 VUs  1m30.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m30.0s      

running (2m01.0s), 23/45 VUs, 1918 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  76% ] 23/40 VUs  1m31.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m29.0s      

running (2m02.0s), 27/45 VUs, 1934 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  77% ] 27/40 VUs  1m32.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m28.0s      

running (2m03.0s), 23/45 VUs, 1958 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  77% ] 23/40 VUs  1m33.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m27.0s      

running (2m04.0s), 25/45 VUs, 1976 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  78% ] 25/40 VUs  1m34.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m26.0s      

running (2m05.0s), 21/45 VUs, 2000 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  79% ] 21/40 VUs  1m35.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m25.0s      

running (2m06.0s), 21/45 VUs, 2020 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  80% ] 21/40 VUs  1m36.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m24.0s      

running (2m07.0s), 24/45 VUs, 2037 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  81% ] 24/40 VUs  1m37.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m23.0s      

running (2m08.0s), 23/45 VUs, 2058 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  82% ] 23/40 VUs  1m38.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m22.0s      

running (2m09.0s), 26/45 VUs, 2075 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  82% ] 26/40 VUs  1m39.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m21.0s      

running (2m10.0s), 22/45 VUs, 2099 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  83% ] 22/40 VUs  1m40.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m20.0s      

running (2m11.0s), 23/45 VUs, 2118 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  84% ] 23/40 VUs  1m41.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m19.0s      

running (2m12.0s), 23/45 VUs, 2138 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  85% ] 23/40 VUs  1m42.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m18.0s      

running (2m13.0s), 24/45 VUs, 2157 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  86% ] 24/40 VUs  1m43.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m17.0s      

running (2m14.0s), 23/45 VUs, 2178 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  87% ] 23/40 VUs  1m44.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m16.0s      

running (2m15.0s), 26/45 VUs, 2195 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  87% ] 26/40 VUs  1m45.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m15.0s      

running (2m16.0s), 26/45 VUs, 2215 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  88% ] 26/40 VUs  1m46.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m14.0s      

running (2m17.0s), 22/46 VUs, 2238 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  89% ] 22/41 VUs  1m47.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m13.0s      

running (2m18.0s), 24/46 VUs, 2256 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  90% ] 24/41 VUs  1m48.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m12.0s      

running (2m19.0s), 25/46 VUs, 2275 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  91% ] 25/41 VUs  1m49.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m11.0s      

running (2m20.0s), 21/46 VUs, 2299 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  92% ] 21/41 VUs  1m50.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m10.0s      

running (2m21.0s), 22/46 VUs, 2318 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  92% ] 22/41 VUs  1m51.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m09.0s      

running (2m22.0s), 25/46 VUs, 2335 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  93% ] 25/41 VUs  1m52.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m08.0s      

running (2m23.0s), 28/46 VUs, 2352 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  94% ] 28/41 VUs  1m53.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m07.0s      

running (2m24.0s), 29/46 VUs, 2371 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  95% ] 29/41 VUs  1m54.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m06.0s      

running (2m25.0s), 21/46 VUs, 2399 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  96% ] 21/41 VUs  1m55.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m05.0s      

running (2m26.0s), 22/46 VUs, 2418 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  97% ] 22/41 VUs  1m56.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m04.0s      

running (2m27.0s), 24/46 VUs, 2436 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  97% ] 24/41 VUs  1m57.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m03.0s      

running (2m28.0s), 25/46 VUs, 2455 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  98% ] 25/41 VUs  1m58.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m02.0s      

running (2m29.0s), 21/46 VUs, 2479 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [  99% ] 21/41 VUs  1m59.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m01.0s      

running (2m30.0s), 22/46 VUs, 2498 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s           5.00 iters/s
main_load   [ 100% ] 22/41 VUs  2m00.0s/2m0s  20.00 iters/s
cool_down • [   0% ] waiting    0m00.0s      

running (2m31.0s), 12/46 VUs, 2514 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ↓ [ 100% ] 23/41 VUs  2m0s       20.00 iters/s
cool_down   [   3% ] 05/05 VUs  01.0s/30s  5.00 iters/s

running (2m32.0s), 04/48 VUs, 2525 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ↓ [ 100% ] 23/41 VUs  2m0s       20.00 iters/s
cool_down   [   7% ] 03/07 VUs  02.0s/30s  5.00 iters/s

running (2m33.0s), 06/48 VUs, 2528 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  10% ] 06/07 VUs  03.0s/30s  5.00 iters/s

running (2m34.0s), 03/49 VUs, 2535 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  13% ] 03/08 VUs  04.0s/30s  5.00 iters/s

running (2m35.0s), 05/49 VUs, 2538 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  17% ] 05/08 VUs  05.0s/30s  5.00 iters/s

running (2m36.0s), 06/49 VUs, 2542 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  20% ] 06/08 VUs  06.0s/30s  5.00 iters/s

running (2m37.0s), 03/50 VUs, 2549 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  23% ] 03/09 VUs  07.0s/30s  5.00 iters/s

running (2m38.0s), 03/50 VUs, 2554 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  27% ] 03/09 VUs  08.0s/30s  5.00 iters/s

running (2m39.0s), 04/50 VUs, 2558 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  30% ] 04/09 VUs  09.0s/30s  5.00 iters/s

running (2m40.0s), 05/50 VUs, 2562 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  33% ] 05/09 VUs  10.0s/30s  5.00 iters/s

running (2m41.0s), 05/50 VUs, 2567 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  37% ] 05/09 VUs  11.0s/30s  5.00 iters/s

running (2m42.0s), 04/50 VUs, 2573 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  40% ] 04/09 VUs  12.0s/30s  5.00 iters/s

running (2m43.0s), 05/50 VUs, 2577 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  43% ] 05/09 VUs  13.0s/30s  5.00 iters/s

running (2m44.0s), 05/50 VUs, 2582 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  47% ] 05/09 VUs  14.0s/30s  5.00 iters/s

running (2m45.0s), 04/50 VUs, 2588 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  50% ] 04/09 VUs  15.0s/30s  5.00 iters/s

running (2m46.0s), 06/50 VUs, 2591 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  53% ] 06/09 VUs  16.0s/30s  5.00 iters/s

running (2m47.0s), 04/50 VUs, 2598 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  57% ] 04/09 VUs  17.0s/30s  5.00 iters/s

running (2m48.0s), 04/50 VUs, 2603 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  60% ] 04/09 VUs  18.0s/30s  5.00 iters/s

running (2m49.0s), 04/50 VUs, 2608 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  63% ] 04/09 VUs  19.0s/30s  5.00 iters/s

running (2m50.0s), 06/50 VUs, 2611 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  67% ] 06/09 VUs  20.0s/30s  5.00 iters/s

running (2m51.0s), 06/50 VUs, 2616 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  70% ] 06/09 VUs  21.0s/30s  5.00 iters/s

running (2m52.0s), 05/50 VUs, 2622 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  73% ] 05/09 VUs  22.0s/30s  5.00 iters/s

running (2m53.0s), 04/50 VUs, 2628 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  77% ] 04/09 VUs  23.0s/30s  5.00 iters/s

running (2m54.0s), 06/50 VUs, 2631 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  80% ] 06/09 VUs  24.0s/30s  5.00 iters/s

running (2m55.0s), 04/51 VUs, 2637 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  83% ] 04/10 VUs  25.0s/30s  5.00 iters/s

running (2m56.0s), 05/51 VUs, 2641 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  87% ] 05/10 VUs  26.0s/30s  5.00 iters/s

running (2m57.0s), 05/51 VUs, 2646 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  90% ] 05/10 VUs  27.0s/30s  5.00 iters/s

running (2m58.0s), 06/51 VUs, 2650 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  93% ] 06/10 VUs  28.0s/30s  5.00 iters/s

running (2m59.0s), 05/51 VUs, 2656 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [  97% ] 05/10 VUs  29.0s/30s  5.00 iters/s

running (3m00.0s), 05/51 VUs, 2661 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s        5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s       20.00 iters/s
cool_down   [ 100% ] 05/10 VUs  30.0s/30s  5.00 iters/s

running (3m01.0s), 02/51 VUs, 2664 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s   5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s  20.00 iters/s
cool_down ↓ [ 100% ] 05/10 VUs  30s   5.00 iters/s
time="2026-03-30T11:48:16-05:00" level=info msg="\n=== Test Completed ===" source=console
time="2026-03-30T11:48:16-05:00" level=info msg="Start : 2026-03-30T16:45:15.161Z" source=console
time="2026-03-30T11:48:16-05:00" level=info msg="End   : 2026-03-30T16:48:16.755Z" source=console
time="2026-03-30T11:48:16-05:00" level=info msg="Review k6 summary above for SLA results." source=console


  █ THRESHOLDS 

    http_req_connecting
    ✓ 'p(95)<100' p(95)=0s

    http_req_duration
    ✗ 'p(95)<1500' p(95)=2.16s

      {staticContent:no}
      ✓ 'p(50)<300' p(50)=0s
      ✓ 'p(90)<800' p(90)=0s
      ✓ 'p(99)<3000' p(99)=0s
      ✓ 'max<5000' max=0s

    http_req_failed
    ✗ 'rate<0.03' rate=20.06%

    http_req_waiting
    ✗ 'p(95)<500' p(95)=2.14s


  █ TOTAL RESULTS 

    checks_total.......: 7998   44.043175/s
    checks_succeeded...: 59.97% 4797 out of 7998
    checks_failed......: 40.02% 3201 out of 7998

    ✗ status is 200
      ↳  0% — ✓ 0 / ✗ 2666
    ✗ response is json
      ↳  79% — ✓ 2131 / ✗ 535
    ✓ responds within 5s

    HTTP
    http_req_duration..............: avg=1.24s min=322.41ms med=1.2s  max=3.87s p(90)=1.97s p(95)=2.16s
      { expected_response:true }...: avg=1.24s min=322.41ms med=1.21s max=3.87s p(90)=1.96s p(95)=2.15s
      { staticContent:no }.........: avg=0s    min=0s       med=0s    max=0s    p(90)=0s    p(95)=0s   
    http_req_failed................: 20.06% 535 out of 2666
    http_reqs......................: 2666   14.681058/s

    EXECUTION
    dropped_iterations.............: 36     0.198244/s
    iteration_duration.............: avg=1.24s min=323.17ms med=1.2s  max=3.87s p(90)=1.97s p(95)=2.16s
    iterations.....................: 2666   14.681058/s
    vus............................: 2      min=1           max=29
    vus_max........................: 51     min=15          max=51

    NETWORK
    data_received..................: 1.6 MB 8.9 kB/s
    data_sent......................: 394 kB 2.2 kB/s



running (3m01.6s), 00/51 VUs, 2666 complete and 0 interrupted iterations
warm_up   ✓ [ 100% ] 00/05 VUs  30s   5.00 iters/s
main_load ✓ [ 100% ] 00/41 VUs  2m0s  20.00 iters/s
cool_down ✓ [ 100% ] 00/10 VUs  30s   5.00 iters/s
time="2026-03-30T11:48:17-05:00" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed, http_req_waiting' have been crossed"